project/app/controllers/api/employees_controller.rb

  def tax_deduction
    @employee = Employee.find(params[:id])
---
SELECT "employees".* FROM "employees" WHERE "employees"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]

  def calculate_total_salary(employee)
  	doj = Employee.find(params[:id]).doj
  	salary = Employee.find(params[:id]).salary
---
SELECT "employees".* FROM "employees" WHERE "employees"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]